In [1]:
import pandas as pd

In [2]:
df_notas = pd.DataFrame({
    "Nome": ["Diana", "Clark", "Bruce"],
    "Port":[9, 7, 8],
    "Mat":[7, 5, 9],
    "Bio":[5, 5, 8]
})
df_notas

    Nome  Port  Mat  Bio
0  Diana     9    7    5
1  Clark     7    5    5
2  Bruce     8    9    8

In [3]:
df_notas.index

RangeIndex(start=0, stop=3, step=1)

In [4]:
df_notas.columns

Index(['Nome', 'Port', 'Mat', 'Bio'], dtype='object')

In [5]:
df_notas.head(2)

    Nome  Port  Mat  Bio
0  Diana     9    7    5
1  Clark     7    5    5

In [6]:
df_notas.tail(2)

    Nome  Port  Mat  Bio
1  Clark     7    5    5
2  Bruce     8    9    8

In [7]:
df_notas["Nome"].head()

0    Diana
1    Clark
2    Bruce
Name: Nome, dtype: object

In [8]:
df_notas[["Nome", "Bio"]].head(2)

    Nome  Bio
0  Diana    5
1  Clark    5